# 2. Напишите программу, которая на вход принимает 5 чисел и находит максимальное из них.

#     Примеры:

#     - 1, 4, 8, 7, 5 -> 8
#     - 78, 55, 36, 90, 2 -> 90


# num1 = int(input('введите первое число:'))
# num2 = int(input('введите второе число:'))
# num3 = int(input('введите третье число:'))
# num4 = int(input('введите четвертое число:'))
# num5 = int(input('введите пятое число:'))

# if num1 > num2 and num1 > num3 and num1 > num4 and num1 > num5:
#     print(f'{num1} максимальное число ')
# elif num2 > num1 and num2 > num3 and num2 > num4 and num2 > num5:
#     print(f'{num2} максимальное число ')
# elif num3 > num1 and num3 > num2 and num3 > num4 and num3 > num5:
#     print(f'{num3} максимальное число ')
# elif num4 > num1 and num4 > num2 and num4 > num3 and num4 > num5:
#     print(f'{num4} максимальное число ')
# else:
#     print(f'{num5} максимальное число ')

# my_max = 0
# for _ in range(5):
#     num = int(input('Введите число: '))
#     if my_max < num:
#         my_max = num

# print(my_max)

# numbers = []
# for i in range(1,6):
#     numbers.append(int(input(f' Введите {i} число: ')))
# print(numbers)
# print(max(numbers))


# my_max = 0
# for _ in range(5):
#     num = int(input('введите число: '))
#     if my_max<num:
#         my_max = num
# print(my_max)